04_perforatedPlate/10_noTextureUniformPerforation/01_baseCase/Allrun.pre
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Clear old IC
rm -rf 0

# create mesh
runApplication blockMesh
#get rid of interfaces
#~ runApplication stitchMesh -perfect -overwrite overInletMaster overInletSlave
#convert holes to cyclic patches
runApplication createPatch -overwrite

# copy IC
mkdir 0
cp -rf 0.org/* 0

#~ runApplication setFields

paraFoam -touch
